results/2026-07-09_v8_tuning/qwen3-30b-a3b-bf16/chunk4096_cap64/shared_prefix/bench.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31221, dataset_name='generated-shared-prefix', dataset_path='', model='/data/hf/models/Qwen3-30B-A3B-Instruct-2507', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v8_tuning/qwen3-30b-a3b-bf16/chunk4096_cap64/shared_prefix/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=32, gsp_prompts_per_group=32, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31221, dataset_name='generated-shared-prefix', dataset_path='', model='/data/hf/models/Qwen3-30B-A3B-Instruct-2507', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v8_tuning/qwen3-30b-a3b-bf16/chunk4096_cap64/shared_prefix/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=32, gsp_prompts_per_group=32, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /home/t-jialianggu/.cache/sglang/benchmark/gen_shared_prefix_1_32_32_2048_128_256_Qwen2TokenizerFast.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1024/1024 [00:54<00:00, 18.68it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     1024      
Benchmark duration (s):                  54.82     
Total input tokens:                      2346565   
Total input text tokens:                 2346565   
Total generated tokens:                  262144    
Total generated tokens (retokenized):    254429    
Request throughput (req/s):              18.68     
Input token throughput (tok/s):          42806.69  
Output token throughput (tok/s):         4782.10   
Peak output token throughput (tok/s):    5942.00   
Peak concurrent requests:                192       
Total token throughput (tok/s):          47588.80  
Concurrency:                             123.67    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6620.68   
Median E2E Latency (ms):                 6546.87   
P90 E2E Latency (ms):                    7933.78   
P99 E2E Latency (ms):                    15261.88  
---------------Time to First Token----------------
Mean TTFT (ms):                          3700.23   
Median TTFT (ms):                        3779.24   
P99 TTFT (ms):                           12185.16  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.45     
Median TPOT (ms):                        11.40     
P99 TPOT (ms):                           13.68     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.46     
Median ITL (ms):                         12.03     
P95 ITL (ms):                            13.12     
P99 ITL (ms):                            14.14     
Max ITL (ms):                            296.25    
==================================================